ConfigFiles/Documents/ЗапускТестирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗапускТестирования</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Pipeline_ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ветка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ветки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВеткаСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапуститьТестыВыполненныеСОшибкой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоТестов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиЗапускаТестирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СборкаВерсии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СборкиВерсии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тег</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РодительскийЗапуск</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗапускТестирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

ConfigFiles/InformationRegisters/РезультатыВыполненияТестов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РезультатыВыполненияТестов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыВыполненияТеста</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗапускТестирования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗапускТестирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗаданияТестирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДочернийЗапускТестирования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗапускТестирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ветка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ветки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тест</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Тесты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭлементТеста</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФормыОбъектовМетаданных</v8:Type>
						<v8:Type>cfg:CatalogRef.ОбъектыМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ConfigFiles/InformationRegisters/ИзмененияВВетках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИзмененияВВетках</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОписаниеИзменений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодробноеОписаниеИзменений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Согласующий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусСогласования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСогласованияИзмененийВВетках</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УстановилСтатус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаИзмененияСтатусаСогласования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомментарийСогласования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредыдущееПодробноеОписаниеИзменений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредыдущийСтатусСогласования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСогласованияИзмененийВВетках</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоммитСогласования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредыдущаяДатаИзмененияСтатусаСогласования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредыдущийУстановилСтатус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипИзменения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИзмененийОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ветка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ветки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подсистемы</v8:Type>
						<v8:Type>cfg:CatalogRef.ОбъектыМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодчиненныйОбъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РеквизитыОбъектовМетаданных</v8:Type>
						<v8:Type>cfg:CatalogRef.МакетыОбъектовМетаданных</v8:Type>
						<v8:Type>cfg:CatalogRef.ФормыОбъектовМетаданных</v8:Type>
						<v8:Type>cfg:EnumRef.ТипыМодулейОбъектовМетаданных</v8:Type>
						<v8:Type>cfg:CatalogRef.КомандыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ConfigFiles/Enums/СтатусыВыполненияТеста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыВыполненияТеста</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыполненУспешно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполненСОшибкой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеЗапускался</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ConfigFiles/Enums/ТипыВеток.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыВеток</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновнаяВеткаПроекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВеткаВерсии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВеткаТехническогоПроекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВеткаДляИсправленияОшибок</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ConfigFiles/Catalogs/Тесты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Тесты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Проекты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>UIDНастройкиСценария</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяВСистемеСборки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаЗапускаПроцесса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиЗапускаПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаЗапускаСценария</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиЗапускаСценариев</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрефиксГруппы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделПроекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыПроекта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатыТестаДетализируютсяПоОбъектамМетаданных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Универсальный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПередаватьСписокИзмененныхОбъектовМетаданных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ConfigFiles/Catalogs/НастройкиЗапускаТестирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>НастройкиЗапускаТестирования</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Проекты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗанимаемаяМощность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредпочтительноеВремяЗапуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Тесты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тест</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Тесты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыЗапуска</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ConfigFiles/Documents/ЗапускТестирования/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если Не ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;	
	
	Автор = Пользователи.ТекущийПользователь();  
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("Ветка") Тогда
			
			Ветка = ДанныеЗаполнения.Ветка;     
			
			ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения.Ветка, "Владелец,НастройкаЗапускаТестирования");
			Проект = ЗначенияРеквизитов.Владелец;
			Настройка = ЗначенияРеквизитов.НастройкаЗапускаТестирования;
			
		ИначеЕсли ДанныеЗаполнения.Свойство("Настройка") Тогда
			
			Настройка = ДанныеЗаполнения.Настройка;
			Проект = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения.Настройка,"Владелец");
			
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Pipeline_ID = "";
	Автор = Пользователи.ТекущийПользователь();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ЗапускатьАвтоматическоеТестирование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Проект,"ЗапускатьАвтоматическоеТестирование");
	Если ДополнительныеСвойства.Свойство("НеЗапускатьАвтоматическоеТестирование") Тогда
		ЗапускатьАвтоматическоеТестирование = Ложь;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение
		И ЗапускатьАвтоматическоеТестирование Тогда
		Если НЕ ЗначениеЗаполнено(Номер) Тогда
			УстановитьНовыйНомер();
		КонецЕсли;
		ИмяВетки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ветка, "Имя");
		Результат = ТестированиеЗапускТестирования.ЗапуститьТестирование(Проект, ИмяВетки, ПараметрыДляЗапускаТестирования());
		
		Если Результат.ЗапросВыполненУспешно Тогда
			Pipeline_ID = Результат.Ответ;
		Иначе
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.Ответ, ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	ЗапускатьАвтоматическоеТестирование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Проект,"ЗапускатьАвтоматическоеТестирование");
	
	Если ЗапускатьАвтоматическоеТестирование
		И ЗначениеЗаполнено(Pipeline_ID) Тогда
		Результат = ТестированиеЗапускТестирования.ОтменитьТестирование(Проект, Pipeline_ID);
		Если НЕ Результат.ЗапросВыполненУспешно Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.Ответ, ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПараметрыДляЗапускаТестирования()
	
	Параметры = Новый Соответствие;
	Параметры.Вставить("TRIGGER_ID", СокрЛП(Номер));
   
	Параметры.Вставить("branch_type", Строка(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ветка, "Тип")));
	Параметры.Вставить("run_failed_tests", Строка(ЗапуститьТестыВыполненныеСОшибкой));
	
	Если ЗапуститьТестыВыполненныеСОшибкой Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	РезультатыВыполненияТестовСрезПоследних.Тест КАК Ссылка,
		               |	РезультатыВыполненияТестовСрезПоследних.Проект.Наименование КАК Проект,
		               |	РезультатыВыполненияТестовСрезПоследних.Проект.ИдентификаторПрограммы КАК ИдентификаторПроекта,
		               |	РезультатыВыполненияТестовСрезПоследних.Тест.Код КАК Код,
		               |	РезультатыВыполненияТестовСрезПоследних.Тест.Наименование КАК Наименование,
		               |	РезультатыВыполненияТестовСрезПоследних.Тест.ИмяВСистемеСборки КАК ИмяВСистемеСборки,
		               |	РезультатыВыполненияТестовСрезПоследних.Тест.UIDНастройкиСценария КАК UIDНастройкиСценария,
		               |	РезультатыВыполненияТестовСрезПоследних.Тест.НастройкаЗапускаСценария.Код КАК НастройкаЗапускаСценарияКод,
		               |	РезультатыВыполненияТестовСрезПоследних.Тест.НастройкаЗапускаПроцесса.Код КАК НастройкаЗапускаПроцессаКод,
		               |	ВЫБОР
		               |		КОГДА РезультатыВыполненияТестовСрезПоследних.Тест.НастройкаЗапускаСценария <> ЗНАЧЕНИЕ(Справочник.НастройкиЗапускаСценариев.ПустаяСсылка)
		               |			ТОГДА РезультатыВыполненияТестовСрезПоследних.Тест.НастройкаЗапускаСценария.Владелец.ИдентификаторБазы
		               |		ИНАЧЕ РезультатыВыполненияТестовСрезПоследних.Тест.НастройкаЗапускаПроцесса.ЭталоннаяБаза.ИдентификаторБазы
		               |	КОНЕЦ КАК ИдентификаторБазы
		               |ИЗ
		               |	РегистрСведений.РезультатыВыполненияТестов.СрезПоследних(
		               |			,
		               |			Ветка = &Ветка
		               |				И ЭлементТеста = НЕОПРЕДЕЛЕНО) КАК РезультатыВыполненияТестовСрезПоследних
		               |ГДЕ
		               |	РезультатыВыполненияТестовСрезПоследних.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыВыполненияТеста.ВыполненУспешно)";
		Запрос.УстановитьПараметр("Ветка", Ветка);
		ЗаполнитьПараметрыДляЗапускаПоТестам(Запрос.Выполнить().Выбрать(), Параметры, "failed");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Настройка) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Тесты.Ссылка КАК Ссылка,
		               |	"""" КАК Проект,
		               |	"""" КАК ИдентификаторПроекта,
		               |	Тесты.Ссылка.Код КАК Код,
		               |	Тесты.Наименование КАК Наименование,
		               |	Тесты.ИмяВСистемеСборки КАК ИмяВСистемеСборки,
		               |	Тесты.UIDНастройкиСценария КАК UIDНастройкиСценария,
		               |	Тесты.НастройкаЗапускаСценария.Код КАК НастройкаЗапускаСценарияКод,
		               |	Тесты.НастройкаЗапускаПроцесса.Код КАК НастройкаЗапускаПроцессаКод,
		               |	ВЫБОР
		               |		КОГДА Тесты.НастройкаЗапускаСценария <> ЗНАЧЕНИЕ(Справочник.НастройкиЗапускаСценариев.ПустаяСсылка)
		               |			ТОГДА Тесты.НастройкаЗапускаСценария.Владелец.ИдентификаторБазы
		               |		ИНАЧЕ Тесты.НастройкаЗапускаПроцесса.ЭталоннаяБаза.ИдентификаторБазы
		               |	КОНЕЦ КАК ИдентификаторБазы
		               |ИЗ
		               |	Справочник.Тесты КАК Тесты
		               |ГДЕ
		               |	(Тесты.Родитель В (&Тесты)
		               |			ИЛИ Тесты.Ссылка В (&Тесты))";
		Запрос.УстановитьПараметр("Тесты", Настройка.Тесты.ВыгрузитьКолонку("Тест"));
		ЗаполнитьПараметрыДляЗапускаПоТестам(Запрос.Выполнить().Выбрать(), Параметры, "test");
		
		Для Каждого Строка Из Настройка.ПараметрыЗапуска Цикл
			НовоеЗначение = Строка.Значение;
			Если Параметры.Получить(Строка.Ключ) <> Неопределено Тогда
				НовоеЗначение = Параметры[Строка.Ключ] + " " + НовоеЗначение;
			КонецЕсли;
			Параметры.Вставить(Строка.Ключ, НовоеЗначение);
		КонецЦикла;
	КонецЕсли;
	
	ТипВетки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ветка,"Тип");
	Если ЗначениеЗаполнено(Настройка)
		И (ТипВетки = Перечисления.ТипыВеток.ВеткаТехническогоПроекта
			ИЛИ ТипВетки = Перечисления.ТипыВеток.ВеткаДляИсправленияОшибок)
		Тогда
		   НадоПередватьСписокИзмененныхОМ = ВНастройкеЕстьТестыПринимающиеСписокИзмененныхОМ(Настройка);
		   
		   Если НадоПередватьСписокИзмененныхОМ Тогда
			   ДобавитьВПараметрыДляЗапускаТестированияИзменнныеОМ(Параметры, Ветка);
		   КонецЕсли;	
		   
	КонецЕсли;

	Возврат Параметры;
	
КонецФункции
 
Процедура ЗаполнитьПараметрыДляЗапускаПоТестам(ВыборкаТестов, Параметры, ИмяПараметра="test")
	ЗаписьJSON = Новый ЗаписьJSON;
	ЕстьТесты = Ложь;
	
	Пока ВыборкаТестов.Следующий() Цикл
		ЕстьТесты = Истина;
			
		ЗаписьJSON.УстановитьСтроку();
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		ЗаписьJSON.ЗаписатьИмяСвойства("Тест");
		ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(ВыборкаТестов.Наименование));   
		ЗаписьJSON.ЗаписатьИмяСвойства("Проект");
		ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(ВыборкаТестов.Проект));
		ЗаписьJSON.ЗаписатьИмяСвойства("ИдентификаторПроекта");
		ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(ВыборкаТестов.ИдентификаторПроекта));
		ЗаписьJSON.ЗаписатьИмяСвойства("ИмяВСистемеСборки");
		ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(ВыборкаТестов.ИмяВСистемеСборки));
		ЗаписьJSON.ЗаписатьИмяСвойства("UIDНастройкиСценария");
		ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(ВыборкаТестов.UIDНастройкиСценария));
		ЗаписьJSON.ЗаписатьИмяСвойства("НастройкаЗапускаСценария");
		ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(ВыборкаТестов.НастройкаЗапускаСценарияКод));
		ЗаписьJSON.ЗаписатьИмяСвойства("НастройкаЗапускаПроцесса");
		ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(ВыборкаТестов.НастройкаЗапускаПроцессаКод));
		ЗаписьJSON.ЗаписатьИмяСвойства("ИдентификаторБазы");
		ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(ВыборкаТестов.ИдентификаторБазы));
		ЗаписьJSON.ЗаписатьКонецОбъекта();
		
		JsonТесты = ЗаписьJSON.Закрыть();    
		КлючПараметра = ИмяПараметра + СокрЛП(ВыборкаТестов.Код) 
						+ "_" + СтрЗаменить(ВыборкаТестов.ИдентификаторПроекта, "-", "_");
		Параметры.Вставить(КлючПараметра, JsonТесты);
			
	КонецЦикла;
	Если ЕстьТесты Тогда 
		Параметры.Вставить("TEST_FILTER", "TRUE");
	КонецЕсли;
	
	ЗаписьJSON = Неопределено;
КонецПроцедуры

Функция ВНастройкеЕстьТестыПринимающиеСписокИзмененныхОМ(ТекНастройка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиЗапускаТестированияТесты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.НастройкиЗапускаТестирования.Тесты КАК НастройкиЗапускаТестированияТесты
		|ГДЕ
		|	НастройкиЗапускаТестированияТесты.Тест.ПередаватьСписокИзмененныхОбъектовМетаданных
		|	И НастройкиЗапускаТестированияТесты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ТекНастройка);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат Истина;
	КонецЦикла;
	
	Возврат Ложь;

КонецФункции

Процедура ДобавитьВПараметрыДляЗапускаТестированияИзменнныеОМ(Параметры, ТекВетка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИзмененияВВетках.ОбъектМетаданных КАК ОбъектМетаданных,
		|	ИзмененияВВетках.ОбъектМетаданных.Наименование КАК ОбъектМетаданныхНаименование
		|ИЗ
		|	РегистрСведений.ИзмененияВВетках КАК ИзмененияВВетках
		|ГДЕ
		|	ИзмененияВВетках.Ветка = &Ветка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИзмененияВВетках.ОбъектМетаданных.Наименование";
	
	Запрос.УстановитьПараметр("Ветка", Ветка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Массив = Новый Массив;
	МаксСчетчик = 30;
	СчетчикПеременных = 0;
	
	Сч = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сч = Сч + 1;
		Массив.Добавить(ВыборкаДетальныеЗаписи.ОбъектМетаданныхНаименование);
		
		Если Сч >= МаксСчетчик Тогда
			Сч = 0;
			СчетчикПеременных = СчетчикПеременных + 1;
			Параметры.Вставить("metadataobjects" + XMLСтрока(СчетчикПеременных), СтрСоединить(Массив, ";"));
			Массив = Новый Массив;
		КонецЕсли;	
		
	КонецЦикла;
	
	Если Массив.Количество() > 0 Тогда
		СчетчикПеременных = СчетчикПеременных + 1;
		Параметры.Вставить("metadataobjects" + XMLСтрока(СчетчикПеременных), СтрСоединить(Массив, ";"));
	Иначе	
		Параметры.Вставить("metadataobjects" + XMLСтрока(СчетчикПеременных), "НетОбъектовДляПроверки");
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
